Revit 2016 API
Level.PlaneReference Property
Returns a reference to this element as a plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2016. Use GetPlaneReference() instead.")]
public Reference PlaneReference { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016. Use GetPlaneReference() instead.")> _
Public ReadOnly Property PlaneReference As Reference
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016. Use GetPlaneReference() instead.")]
public:
property Reference^ PlaneReference {
	Reference^ get ();
}
Remarks
The object returned here can be used with the PointOnPlane class.
See Also
Level Class
Autodesk.Revit.DB Namespace